axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/inc/n32g401f8s7_1_dma.h
/** DMA flags definition **/
#define DMA_CH1_GLBF    ((uint32_t)DMA_INTSTS_GLBF1) /* DMA Channel1 global flag */
#define DMA_CH1_TXCF    ((uint32_t)DMA_INTSTS_TXCF1) /* DMA Channel1 transfer complete flag */
#define DMA_CH1_HTXF    ((uint32_t)DMA_INTSTS_HTXF1) /* DMA Channel1 half transfer flag */
#define DMA_CH1_ERRF    ((uint32_t)DMA_INTSTS_ERRF1) /* DMA Channel1 transfer error flag */
#define DMA_CH2_GLBF    ((uint32_t)DMA_INTSTS_GLBF2) /* DMA Channel2 global flag */
#define DMA_CH2_TXCF    ((uint32_t)DMA_INTSTS_TXCF2) /* DMA Channel2 transfer complete flag */
#define DMA_CH2_HTXF    ((uint32_t)DMA_INTSTS_HTXF2) /* DMA Channel2 half transfer flag */
#define DMA_CH2_ERRF    ((uint32_t)DMA_INTSTS_ERRF2) /* DMA Channel2 transfer error flag */
#define DMA_CH3_GLBF    ((uint32_t)DMA_INTSTS_GLBF3) /* DMA Channel3 global flag */
#define DMA_CH3_TXCF    ((uint32_t)DMA_INTSTS_TXCF3) /* DMA Channel3 transfer complete flag */
#define DMA_CH3_HTXF    ((uint32_t)DMA_INTSTS_HTXF3) /* DMA Channel3 half transfer flag */
#define DMA_CH3_ERRF    ((uint32_t)DMA_INTSTS_ERRF3) /* DMA Channel3 transfer error flag */
#define DMA_CH4_GLBF    ((uint32_t)DMA_INTSTS_GLBF4) /* DMA Channel4 global flag */
#define DMA_CH4_TXCF    ((uint32_t)DMA_INTSTS_TXCF4) /* DMA Channel4 transfer complete flag */
#define DMA_CH4_HTXF    ((uint32_t)DMA_INTSTS_HTXF4) /* DMA Channel4 half transfer flag */
#define DMA_CH4_ERRF    ((uint32_t)DMA_INTSTS_ERRF4) /* DMA Channel4 transfer error flag */
#define DMA_CH5_GLBF    ((uint32_t)DMA_INTSTS_GLBF5) /* DMA Channel5 global flag */
#define DMA_CH5_TXCF    ((uint32_t)DMA_INTSTS_TXCF5) /* DMA Channel5 transfer complete flag */
#define DMA_CH5_HTXF    ((uint32_t)DMA_INTSTS_HTXF5) /* DMA Channel5 half transfer flag */
#define DMA_CH5_ERRF    ((uint32_t)DMA_INTSTS_ERRF5) /* DMA Channel5 transfer error flag */
#define DMA_CH6_GLBF    ((uint32_t)DMA_INTSTS_GLBF6) /* DMA Channel6 global flag */
#define DMA_CH6_TXCF    ((uint32_t)DMA_INTSTS_TXCF6) /* DMA Channel6 transfer complete flag */
#define DMA_CH6_HTXF    ((uint32_t)DMA_INTSTS_HTXF6) /* DMA Channel6 half transfer flag */
#define DMA_CH6_ERRF    ((uint32_t)DMA_INTSTS_ERRF6) /* DMA Channel6 transfer error flag */
#define DMA_CH7_GLBF    ((uint32_t)DMA_INTSTS_GLBF7) /* DMA Channel7 global flag */
#define DMA_CH7_TXCF    ((uint32_t)DMA_INTSTS_TXCF7) /* DMA Channel7 transfer complete flag */
#define DMA_CH7_HTXF    ((uint32_t)DMA_INTSTS_HTXF7) /* DMA Channel7 half transfer flag */
#define DMA_CH7_ERRF    ((uint32_t)DMA_INTSTS_ERRF7) /* DMA Channel7 transfer error flag */
#define DMA_CH8_GLBF    ((uint32_t)DMA_INTSTS_GLBF8) /* DMA Channel8 global flag */
#define DMA_CH8_TXCF    ((uint32_t)DMA_INTSTS_TXCF8) /* DMA Channel8 transfer complete flag */
#define DMA_CH8_HTXF    ((uint32_t)DMA_INTSTS_HTXF8) /* DMA Channel8 half transfer flag */
#define DMA_CH8_ERRF    ((uint32_t)DMA_INTSTS_ERRF8) /* DMA Channel8 transfer error flag */

/** DMA remap channel request definition **/
#define DMA_REMAP_ADC       ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      & DMA_CHSEL_CH_SEL_1 \
                                      & DMA_CHSEL_CH_SEL_2 \
                                      & DMA_CHSEL_CH_SEL_3 \
                                      & DMA_CHSEL_CH_SEL_4 \
                                      & DMA_CHSEL_CH_SEL_5)) /* DMA Request For ADC */
#define DMA_REMAP_UART1_TX  ((uint32_t)(DMA_CHSEL_CH_SEL_0)) /* DMA Request For UART1_TX */
#define DMA_REMAP_UART1_RX  ((uint32_t)(DMA_CHSEL_CH_SEL_1)) /* DMA Request For UART1_RX */
#define DMA_REMAP_USART2_TX ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1)) /* DMA Request For USART2_TX */
#define DMA_REMAP_USART2_RX ((uint32_t)(DMA_CHSEL_CH_SEL_2)) /* DMA Request For USART2_RX */
#define DMA_REMAP_UART4_TX  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2)) /* DMA Request For UART4_TX */
#define DMA_REMAP_UART4_RX  ((uint32_t)(DMA_CHSEL_CH_SEL_3)) /* DMA Request For UART4_RX */
#define DMA_REMAP_SPI1_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI1_TX */
#define DMA_REMAP_SPI1_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI1_RX */
#define DMA_REMAP_SPI2_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI2_TX */
#define DMA_REMAP_SPI2_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI2_RX */
#define DMA_REMAP_I2C1_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For I2C1_TX */
#define DMA_REMAP_I2C1_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For I2C1_RX */
#define DMA_REMAP_I2C2_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For I2C2_TX */
#define DMA_REMAP_I2C2_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_4)) /* DMA Request For I2C2_RX */
#define DMA_REMAP_TIM1_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH1 */
#define DMA_REMAP_TIM1_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH2 */
#define DMA_REMAP_TIM1_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH3 */
#define DMA_REMAP_TIM1_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH4 */
#define DMA_REMAP_TIM1_COM  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_COM */
#define DMA_REMAP_TIM1_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_UP */
#define DMA_REMAP_TIM1_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_TRIG */
#define DMA_REMAP_TIM2_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH1 */
#define DMA_REMAP_TIM2_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH2 */
#define DMA_REMAP_TIM2_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH3 */
#define DMA_REMAP_TIM2_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH4 */
#define DMA_REMAP_TIM2_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_UP */
#define DMA_REMAP_TIM3_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM3_CH1 */
#define DMA_REMAP_TIM3_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM3_CH3 */
#define DMA_REMAP_TIM3_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM3_CH4 */
#define DMA_REMAP_TIM3_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_UP */
#define DMA_REMAP_TIM3_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_TRIG */
#define DMA_REMAP_TIM4_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_CH1 */
#define DMA_REMAP_TIM4_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_CH2 */
#define DMA_REMAP_TIM4_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_CH3 */
#define DMA_REMAP_TIM4_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_UP */
#define DMA_REMAP_TIM5_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH1 */
#define DMA_REMAP_TIM5_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH2 */
#define DMA_REMAP_TIM5_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH3 */
#define DMA_REMAP_TIM5_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH4 */
#define DMA_REMAP_TIM5_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_UP */
#define DMA_REMAP_TIM5_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_TRIG */
#define DMA_REMAP_TIM6_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM6_UP */
#define DMA_REMAP_TIM8_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM8_CH1 */
#define DMA_REMAP_TIM8_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM8_CH2 */
#define DMA_REMAP_TIM8_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM8_CH3 */
#define DMA_REMAP_TIM8_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM8_CH4 */
#define DMA_REMAP_TIM8_COM  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM8_COM */
#define DMA_REMAP_TIM8_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM8_UP */
#define DMA_REMAP_TIM8_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM8_TRIG */

/** DMA Channelx interrupt pending bit masks definition **/
#define DMA_CH1_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF1 | DMA_INTSTS_TXCF1 | DMA_INTSTS_HTXF1 | DMA_INTSTS_ERRF1))
#define DMA_CH2_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF2 | DMA_INTSTS_TXCF2 | DMA_INTSTS_HTXF2 | DMA_INTSTS_ERRF2))
#define DMA_CH3_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF3 | DMA_INTSTS_TXCF3 | DMA_INTSTS_HTXF3 | DMA_INTSTS_ERRF3))
#define DMA_CH4_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF4 | DMA_INTSTS_TXCF4 | DMA_INTSTS_HTXF4 | DMA_INTSTS_ERRF4))
#define DMA_CH5_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF5 | DMA_INTSTS_TXCF5 | DMA_INTSTS_HTXF5 | DMA_INTSTS_ERRF5))
#define DMA_CH6_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF6 | DMA_INTSTS_TXCF6 | DMA_INTSTS_HTXF6 | DMA_INTSTS_ERRF6))
#define DMA_CH7_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF7 | DMA_INTSTS_TXCF7 | DMA_INTSTS_HTXF7 | DMA_INTSTS_ERRF7))
#define DMA_CH8_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF8 | DMA_INTSTS_TXCF8 | DMA_INTSTS_HTXF8 | DMA_INTSTS_ERRF8))

