axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/inc/n32g401f8s7_1_dma.h
/*** DMA Macro Definition End ***/


/*** DMA Driving Functions Declaration ***/
void DMA_Reset(DMA_ChannelType* DMAChx);
void DMA_Initializes(DMA_ChannelType* DMAChx, DMA_InitType* DMA_InitParam);
void DMA_Peripheral_Address_Config(DMA_ChannelType* DMAChx, uint32_t addr);
void DMA_Memory_Address_Config(DMA_ChannelType* DMAChx, uint32_t addr);
void DMA_Destination_Config(DMA_ChannelType* DMAChx, uint32_t direction);
void DMA_Buffer_Size_Config(DMA_ChannelType* DMAChx, uint32_t buf_size);
void DMA_Peripheral_Addr_Increment_Config(DMA_ChannelType* DMAChx, uint32_t periph_inc);
void DMA_Memory_Addr_Increment_Config(DMA_ChannelType* DMAChx, uint32_t memory_inc);
void DMA_Peripheral_Data_Width_Config(DMA_ChannelType* DMAChx, uint32_t width);
void DMA_Memory_Data_Width_Config(DMA_ChannelType* DMAChx, uint32_t width);
void DMA_Circular_Mode_Config(DMA_ChannelType* DMAChx, uint32_t cmd);
void DMA_Priority_Config(DMA_ChannelType* DMAChx, uint32_t priority);
void DMA_Memory_2_Memory_Config(DMA_ChannelType* DMAChx, uint32_t cmd);
void DMA_Structure_Initializes(DMA_InitType* DMA_InitParam);
void DMA_Channel_Enable(DMA_ChannelType* DMAChx);
void DMA_Channel_Disable(DMA_ChannelType* DMAChx);
void DMA_Interrupts_Enable(DMA_ChannelType* DMAChx, uint32_t interrupt);
void DMA_Interrupts_Disable(DMA_ChannelType* DMAChx, uint32_t interrupt);
void DMA_Current_Data_Transfer_Number_Set(DMA_ChannelType* DMAChx, uint16_t num);
uint16_t DMA_Current_Data_Transfer_Number_Get(DMA_ChannelType* DMAChx);
FlagStatus DMA_Flag_Status_Get(DMA_Module* DMAx, uint32_t flag);
void DMA_Flag_Status_Clear(DMA_Module* DMAx, uint32_t flag);
INTStatus DMA_Interrupt_Status_Get(DMA_Module* DMAx, uint32_t interrupt);
void DMA_Interrupt_Status_Clear(DMA_Module* DMAx, uint32_t interrupt);
void DMA_Channel_Request_Remap(DMA_ChannelType* DMAChx, uint32_t req_remap);

#ifdef __cplusplus
}
#endif

#endif /*__N32G401F8S7_1_DMA_H__ */

